[
    "Явно торопясь в школу, Игнат вышел из метро. Противный сухой ветер ударил в лицо. Что поделать, погоду ведь не выбирают. Стараясь не задумываться ни о чем, он поспешил к перекрестку. Как только Игнат подбежал к дороге, светофор мигнул зеленым и, будто издеваясь, переключился на красный.",
    {
        "[Развернуться и пойти домой]": "Игнат слишком поздно заметил приближение Паровозика Томаса, и был сбит насмерть.",
        "[Дождаться зеленого и спокойно перейти]": [
            "-- \"Безопасность - это главное\", - подумал он и, дождавшись сигнала, торопливо пересек проезжую часть. Успешно перейдя дорогу, Игнат оглянулся назад и, убедившись, что Паровозика Томаса не видно, продолжил двигаться к школе. Подойдя к калитке, он протянул руку к кнопке и задумавшись, застыл.",
            {
                "[Нажать на кнопку]": [
                    "Из динамика зазвучала приятная мелодия, и через пару мгновений калитка открылась. Не испытывая судьбу, Игнат потянул ее на себя и прошел во двор школы. Войдя на территорию школы Игнат почувствовал себя не в своей тарелке. Около заднего входа стояла огромная куча велосипедов и самокатов. \"Было бы весело угнать их и продать на рынке\", - пронеслось у него в голове. Зайдя в здание Игнат лениво прокрутил турникет и, побранившись на медленно работающих строителей, реставрирующих лестницу, оглядел холл этажа. Внезапно он вспомнил, что до начала уроков осталось лишь 5 минут. Игнат поспешил на четвёртый этаж в надежде на то, что аудиторию ещё не поменяли.Решив рискнуть, Игнат влетел в кабинет, который был в расписании вчера. Это оказался не тот кабинет. На него уставилась масса неприветливых. Все ученики в аудитории превратились в огромную, уродливую биомассу, смотрящую на него всеми своими кровоточащими глазами. Он закрыл дверь с каменным лицом.",
                    {
                        "[Танцевать макарену]": [
                            "Игнат станцевал макарену в мусорке, после чего проверил расписание. Администратор решил поменять кабинет на Квантовый Зал и Игнату пришлось спускаться на первый этаж, в процессе спуска он придумал новое слово для описания администратора, который меняет кабинет в самый неподходящий момент. Cпустившись на первый этаж, Игнат зашёл в квантовый зал. Как ему показалось, там находилась ещё одна биомасса. Но нет, это оказались лишь его одноклассники. Хотя , все не так просто: из их ртов торчали лампочки, зловеще мигая красным и зеленым. Один из присутствующих хрипло поинтересовался: \"А г-где... т-т-твоя... л-лампочка?..\"",
                            {
                                "[Показать красную лампочку]": "Кажется, Паровозик Томас не одобрил эту идею: сбить Игната показалось ему правильным решением.",
                                "[Показать зеленую лампочку]": "За вопросом последовала реакция Игната. Он незамедлительно вставил зелёную лампочку себе в рот и сел на место. Это всего лишь простой рутинный день."
                            }
                        ]
                    }
                ],
                "[Развернуться и пойти домой]": "Решение оказалось не из лучших. Последнее, что увидел Игнат был логотип Макдональдса на трубе Паровозика Томаса, вылезшего из ближайшего канализационного люка."
            }
        ],
        "[Перебежать дорогу на красный]": [
            "Несмотря на риск быть сбитым какой-нибудь машиной, он, покрепче схватившись за лямку рюкзака, рванул вперед. Игнат не подозревал о том, что за ним наблюдают. Скрестив руки на груди, какой-то учитель заметил, что он грубо нарушил правила дорожного движения. Очевидно, ему это зачтется. Более-менее успешно перейдя дорогу, Игнат оглянулся назад и, убедившись, что Паровозика Томаса не видно, продолжил двигаться к школе. Подойдя к калитке, он протянул руку к кнопке и задумавшись, застыл.",
            {
                "[Нажать на кнопку]": [
                    "Из динамика зазвучала приятная мелодия, и через пару мгновений калитка открылась. Не испытывая судьбу, Игнат потянул ее на себя и прошел во двор школы. Войдя на территорию школы Игнат почувствовал себя не в своей тарелке. Около заднего входа стояла огромная куча велосипедов и самокатов. \"Было бы весело угнать их и продать на рынке\", - пронеслось у него в голове. Зайдя в здание Игнат лениво прокрутил турникет и, побранившись на медленно работающих строителей, реставрирующих лестницу, оглядел холл этажа. Внезапно он вспомнил, что до начала уроков осталось лишь 5 минут. Игнату явно стоит поторопиться. Но, к несчастью, к нему приблизился учитель, наблюдавший за ним из окна. \"Вы перешли дорогу на красный свет, такое поведение недопустимо\", -  преподаватель протянул Игнату листочек бумаги и ручку.",
                    {
                        "[Написать объяснительную]": "Скрепя сердце, Игнат взял письменные принадлежности и наскоро написал не один десяток спасительных слов. Встретив одобряющий взгляд учителя, он протянул злополучную бумажку и, схватив рюкзак, припустил к аудитории. Зайдя в нужную аудиторию его взору предстала прекрасная картина: ♂️Dungeon master♂️ и Паровозик Томас преподавали способы выживания в ♂️Dungeon♂️. Игнат сел на своё место и начал впитывать важнейшую информацию. В класс вошел черепашка-ниндзя. Почему-то черепашка решил срезать голову Игнату. Жаль, что система безопасности в школе была недостаточно хороша для того, чтобы не пропустить черепашку.",
                        "[Убежать]": "Резко развернувшись, Игнат помчался к нужной аудитории. Первые секунды позади себя он слышал стук каблуков о каменный пол, но потом - грохот игрушечных колес. Не оборачиваясь, Игнат свернул направо и вбежал в кабинет. И, надо сказать, вовремя: не вписавшись во внезапный поворот, Паровозик Томас вылетел в окно. Удача явно выбрала сторону Игната. \"Надеюсь, он zдох...\" - облегченно подумал он. Войдя в свою аудиторию, Игнат услышал гудок поезда. Сначала он не мог понять, откуда доносится звук. Спустя некоторое время с лестничной клетки отчетливо послышался стук колёс. Игнат попросился выйти из кабинета, чтобы проверить что это был за шум. Там его поджидал Паровозик Томас: а он не из тех, кто церемонится.",
                        "[Развернуться и пойти домой]": "Видимо, такой вариант не устроил Паровозика Томаса, поэтому тот на полной скорости влетел в окно здания и сбил Игната."
                    }
                ],
                "[Развернуться и пойти домой]": "Решение оказалось не из лучших. Последнее, что увидел Игнат был логотип Макдональдса на трубе Паровозика Томаса, вылезшего из ближайшего канализационного люка."
            }
        ]
    }
]